a = input('Введите два числа в текстовом виде, а между ними - "плюс", "минус" или "умножить": ')
def calc(a):
    (f_1, m_1, q, r, s, o_2, p_2, count, pris, prisnak) = (0, 0, 2, 2, 1, 1, 1, 0, 0, 0)
    lst_1 = []
    lst_2 = []
    dic_1 = {'ноль' : 0, 'один' : 1, 'два' : 2, 'три' : 3, 'четыре' : 4, 'пять' : 5, 'шесть' : 6, 'семь' : 7, 'восемь' : 8, 'девять' : 9, 'десять' : 10, 'одиннадцать' : 11, 'двенадцать' : 12, 'тринадцать' : 13, 'четырнадцать' : 14, 'пятнадцать' : 15, 'шестнадцать' : 16, 'семнадцать' : 17, 'восемнадцать' : 18, 'девятнадцать' : 19, 'двадцать' : 20, 'двадцать один' : 21, 'двадцать два' : 22, 'двадцать три' : 23, 'двадцать четыре' : 24, 'двадцать пять' : 25, 'двадцать шесть' : 26, 'двадцать семь' : 27, 'двадцать восемь' : 28, 'двадцать девять' : 29, 'тридцать' : 30, 'тридцать один' : 31, 'тридцать два' : 32, 'тридцать три' : 33, 'тридцать четыре' : 34, 'тридцать пять' : 35, 'тридцать шесть' : 36, 'тридцать семь' : 37, 'тридцать восемь' : 38, 'тридцать девять' : 39, 'сорок' : 40, 'сорок один' : 41, 'сорок два' : 42, 'сорок три' : 43, 'сорок четыре' : 44, 'сорок пять' : 45, 'сорок шесть' : 46, 'сорок семь' : 47, 'сорок восемь' : 48, 'сорок девять' : 49, 'пятьдесят' : 50, 'пятьдесят один' : 51, 'пятьдесят два' : 52, 'пятьдесят три' : 53, 'пятьдесят четыре' : 54, 'пятьдесят пять' : 55, 'пятьдесят шесть' : 56, 'пятьдесят семь' : 57, 'пятьдесят восемь' : 58, 'пятьдесят девять' : 59, 'шестьдесят' : 60, 'шестьдесят один' : 61, 'шестьдесят два' : 62, 'шестьдесят три' : 63, 'шестьдесят четыре' : 64, 'шестьдесят пять' : 65, 'шестьдесят шесть' : 66, 'шестьдесят семь' : 67, 'шестьдесят восемь' : 68, 'шестьдесят девять' : 69, 'семьдесят' : 70, 'семьдесят один' : 71, 'семьдесят два' : 72, 'семьдесят три' : 73, 'семьдесят четыре' : 74, 'семьдесят пять' : 75, 'семьдесят шесть' : 76, 'семьдесят семь' : 77, 'семьдесят восемь' : 78, 'семьдесят девять' : 79, 'восемьдесят' : 80, 'восемьдесят один' : 81, 'восемьдесят два' : 82, 'восемьдесят три' : 83, 'восемьдесят четыре' : 84, 'восемьдесят пять' : 85, 'восемьдесят шесть' : 86, 'восемьдесят семь' : 87, 'восемьдесят восемь' : 88, 'восемьдесят девять' : 89, 'девяносто' : 90, 'девяносто один' : 91, 'девяносто два' : 92, 'девяносто три' : 93, 'девяносто четыре' : 94, 'девяносто пять' : 95, 'девяносто шесть' : 96, 'девяносто семь' : 97, 'девяносто восемь' : 98, 'девяносто девять' : 99}
    dic_2 = {'сто' : 1, 'двести' : 2, 'триста' : 3, 'четыреста' : 4, 'пятьсот' : 5, 'шестьсот' : 6, 'семьсот' : 7, 'восемьсот' : 8, 'девятьсот' : 9}
    dic_3 = {'одна тысяча' : 1, 'две тысячи' : 2, 'три тысячи' : 3, 'четыре тысячи' : 4, 'пять тысяч' : 5, 'шесть тысяч' : 6, 'семь тысяч' : 7, 'восемь тысяч' : 8, 'девять тысяч' : 9}
    dic_4 = {'одна' : 1, 'две' : 2, 'три' : 3, 'четыре' : 4, 'пять' : 5, 'шесть' : 6, 'семь' : 7, 'восемь' : 8, 'девять' : 9, 'десять' : 10, 'одиннадцать' : 11, 'двенадцать' : 12, 'тринадцать' : 13, 'четырнадцать' : 14, 'пятнадцать' : 15, 'шестнадцать' : 16, 'семнадцать' : 17, 'восемнадцать' : 18, 'девятнадцать' : 19, 'двадцать' : 20, 'двадцать одна' : 21, 'двадцать две' : 22, 'двадцать три' : 23, 'двадцать четыре' : 24, 'двадцать пять' : 25, 'двадцать шесть' : 26, 'двадцать семь' : 27, 'двадцать восемь' : 28, 'двадцать девять' : 29, 'тридцать' : 30, 'тридцать одна' : 31, 'тридцать две' : 32, 'тридцать три' : 33, 'тридцать четыре' : 34, 'тридцать пять' : 35, 'тридцать шесть' : 36, 'тридцать семь' : 37, 'тридцать восемь' : 38, 'тридцать девять' : 39, 'сорок' : 40, 'сорок одна' : 41, 'сорок две' : 42, 'сорок три' : 43, 'сорок четыре' : 44, 'сорок пять' : 45, 'сорок шесть' : 46, 'сорок семь' : 47, 'сорок восемь' : 48, 'сорок девять' : 49, 'пятьдесят' : 50, 'пятьдесят одна' : 51, 'пятьдесят две' : 52, 'пятьдесят три' : 53, 'пятьдесят четыре' : 54, 'пятьдесят пять' : 55, 'пятьдесят шесть' : 56, 'пятьдесят семь' : 57, 'пятьдесят восемь' : 58, 'пятьдесят девять' : 59, 'шестьдесят' : 60, 'шестьдесят одна' : 61, 'шестьдесят две' : 62, 'шестьдесят три' : 63, 'шестьдесят четыре' : 64, 'шестьдесят пять' : 65, 'шестьдесят шесть' : 66, 'шестьдесят семь' : 67, 'шестьдесят восемь' : 68, 'шестьдесят девять' : 69, 'семьдесят' : 70, 'семьдесят одна' : 71, 'семьдесят две' : 72, 'семьдесят три' : 73, 'семьдесят четыре' : 74, 'семьдесят пять' : 75, 'семьдесят шесть' : 76, 'семьдесят семь' : 77, 'семьдесят восемь' : 78, 'семьдесят девять' : 79, 'восемьдесят' : 80, 'восемьдесят одна' : 81, 'восемьдесят две' : 82, 'восемьдесят три' : 83, 'восемьдесят четыре' : 84, 'восемьдесят пять' : 85, 'восемьдесят шесть' : 86, 'восемьдесят семь' : 87, 'восемьдесят восемь' : 88, 'восемьдесят девять' : 89, 'девяносто' : 90, 'девяносто одна' : 91, 'девяносто две' : 92, 'девяносто три' : 93, 'девяносто четыре' : 94, 'девяносто пять' : 95, 'девяносто шесть' : 96, 'девяносто семь' : 97, 'девяносто восемь' : 98, 'девяносто девять' : 99}
    dic_5 = {'нулевая' : 0, 'нулевых': 0, 'первая' : 1, 'первых' : 1, 'вторая' : 2, 'вторых' : 2, 'третья' : 3, 'третьих' : 3, 'четвёртая' : 4, 'четвёртых' : 4, 'пятая' : 5, 'пятых' : 5, 'шестая' : 6, 'шестых' : 6, 'седьмая' : 7, 'седьмых' : 7, 'восьмая' : 8, 'восьмых' : 8, 'девятая' : 9, 'девятых' : 9, 'десятая' : 10, 'десятых' : 10, 'одиннадцатая' : 11, 'одиннадцатых' : 11, 'двенадцатая' : 12, 'двенадцатых' : 12, 'тринадцатая' : 13, 'тринадцатых' : 13, 'четырнадцатая' : 14, 'четырнадцатых' : 14, 'пятнадцатая' : 15, 'пятнадцатых' : 15, 'шестнадцатая' : 16, 'шестнадцатых' : 16, 'семнадцатая' : 17, 'семнадцатых' : 17, 'восемнадцатая' : 18, 'восемнадцатых' : 18, 'девятнадцатая' : 19, 'девятнадцатых' : 19, 'двадцатая' : 20, 'двадцатых' : 20, 'двадцать первая' : 21, 'двадцать первых' : 21, 'двадцать вторая' : 22, 'двадцать вторых' : 22, 'двадцать третья' : 23, 'двадцать третьих' : 23, 'двадцать четвёртая' : 24, 'двадцать четвёртых' : 24, 'двадцать пятая' : 25, 'двадцать пятых' : 25, 'двадцать шестая' : 26, 'двадцать шестых' : 26, 'двадцать седьмая' : 27, 'двадцать седьмых' : 27, 'двадцать восьмая' : 28, 'двадцать восьмых' : 28, 'двадцать девятая' : 28, 'двадцать девятых' : 29, 'тридцатая' : 30, 'тридцатых' : 30, 'тридцать первая' : 31, 'тридцать первых' : 31, 'тридцать вторая' : 32, 'тридцать вторых' : 32, 'тридцать третья' : 33, 'тридцать третьих' : 33, 'тридцать четвёртая' : 34, 'тридцать четвёртых' : 34, 'тридцать пятая' : 35, 'тридцать пятых' : 35, 'тридцать шестая' : 36, 'тридцать шестых' : 36, 'тридцать седьмая' : 37, 'тридцать седьмых' : 37, 'тридцать восьмая' : 38, 'тридцать восьмых' : 38, 'тридцать девятая' : 39, 'тридцать девятых' : 39, 'сороковая' : 40, 'сороковых' : 40, 'сорок первая' : 41, 'сорок первых' : 41, 'сорок вторая' : 42, 'сорок вторых' : 42, 'сорок третья' : 43, 'сорок третьих' : 43, 'сорок четвёртая' : 44, 'сорок четвёртых' : 44, 'сорок пятая' : 45, 'сорок пятых' : 45, 'сорок шестая' : 46, 'сорок шестых' : 46, 'сорок седьмая' : 47, 'сорок седьмых' : 47, 'сорок восьмая' : 48, 'сорок восьмых' : 48, 'сорок девятая' : 49, 'сорок девятых' : 49, 'пятидесятая' : 50, 'пятидесятых' : 50, 'пятьдесят первая' : 51, 'пятьдесят первых' : 51, 'пятьдесят вторая' : 52, 'пятьдесят вторых' : 52, 'пятьдесят третья' : 53, 'пятьдесят третьих' : 53, 'пятьдесят четвёртая' : 54, 'пятьдесят четвёртых' : 54, 'пятьдесят пятая' : 55, 'пятьдесят пятых' : 55, 'пятьдесят шестая' : 56, 'пятьдесят шестых' : 56, 'пятьдесят седьмая' : 57, 'пятьдесят седьмых' : 57, 'пятьдесят восьмая' : 58, 'пятьдесят восьмых' : 58, 'пятьдесят девятая' : 59, 'пятьдесят девятых' : 59, 'шестидесятая' : 60, 'шестидесятых' : 60, 'шестьдесят первая' : 61, 'шестьдесят первых' : 61, 'шестьдесят вторая' : 62, 'шестьдесят вторых' : 62, 'шестьдесят третья' : 63, 'шестьдесят третьих' : 63, 'шестьдесят четвёртая' : 64, 'шестьдесят четвёртых' : 64, 'шестьдесят пятая' : 65, 'шестьдесят пятых' : 65, 'шестьдесят шестая' : 66, 'шестьдесят шестых' : 66, 'шестьдесят седьмая' : 67, 'шестьдесят седьмых' : 67, 'шестьдесят восьмая' : 68, 'шестьдесят восьмых' : 68, 'шестьдесят девятая' : 69, 'шестьдесят девятых' : 69, 'семидесятая' : 70, 'семидесятых' : 70, 'семьдесят первая' : 71, 'семьдесят первых' : 71, 'семьдесят вторая' : 72, 'семьдесят вторых' : 72, 'семьдесят третья' : 73, 'семьдесят третьих' : 73, 'семьдесят четвёртая' : 74, 'семьдесят четвёртых' : 74, 'семьдесят пятая' : 75, 'семьдесят пятых' : 75, 'семьдесят шестая' : 76, 'семьдесят шестых' : 76, 'семьдесят седьмая' : 77, 'семьдесят седьмых' : 77, 'семьдесят восьмая' : 78, 'семьдесят восьмых' : 78, 'семьдесят девятая' : 79, 'семьдесят девятых' : 79, 'восьмидесятая' : 80, 'восьмидесятых' : 80, 'восемьдесят первая' : 81, 'восемьдесят первых' : 81, 'восемьдесят вторая' : 82, 'восемьдесят вторых' : 82, 'восемьдесят третья' : 83, 'восемьдесят третьих' : 83, 'восемьдесят четвёртая' : 84, 'восемьдесят четвёртых' : 84, 'восемьдесят пятая' : 85, 'восемьдесят пятых' : 85, 'восемьдесят шестая' : 86, 'восемьдесят шестых' : 86, 'восемьдесят седьмая' : 87, 'восемьдесят седьмых' : 87, 'восемьдесят восьмая' : 88, 'восемьдесят восьмых' : 88, 'восемьдесят девятая' : 89, 'восемьдесят девятых' : 89, 'девяностая' : 90, 'девяностых' : 90, 'девяносто первая' : 91, 'девяносто первых' : 91, 'девяносто вторая' : 92, 'девяносто вторых' : 92, 'девяносто третья' : 93, 'девяносто третьих' : 93, 'девяносто четвёртая' : 94, 'девяносто четвёртых' : 94, 'девяносто пятая' : 95, 'девяносто пятых' : 95, 'девяносто шестая' : 96, 'девяносто шестых' : 96, 'девяносто седьмая' : 97, 'девяносто седьмых' : 97, 'девяносто восьмая' : 98, 'девяносто восьмых' : 98, 'девяносто девятая' : 99, 'девяносто девятых' : 99, 'сотая' : 100, 'сотых' : 100}
    dic_6 = {'вторая' : 2, 'третья' : 3, 'четвёртая' : 4, 'пятая' : 5, 'шестая' : 6, 'седьмая' : 7, 'восьмая' : 8, 'девятая' : 9, 'десятая' : 10, 'одиннадцатая' : 11, 'двенадцатая' : 12, 'тринадцатая' : 13, 'четырнадцатая' : 14, 'пятнадцатая' : 15, 'шестнадцатая' : 16, 'семнадцатая' : 17, 'восемнадцатая' : 18, 'девятнадцатая' : 19, 'двадцатая' : 20, 'двадцать первая' : 21, 'двадцать вторая' : 22, 'двадцать третья' : 23, 'двадцать четвёртая' : 24, 'двадцать пятая' : 25, 'двадцать шестая' : 26, 'двадцать седьмая' : 27, 'двадцать восьмая' : 28, 'двадцать девятая' : 28, 'тридцатая' : 30, 'тридцать первая' : 31, 'тридцать вторая' : 32, 'тридцать третья' : 33, 'тридцать четвёртая' : 34, 'тридцать пятая' : 35, 'тридцать шестая' : 36, 'тридцать седьмая' : 37, 'тридцать восьмая' : 38, 'тридцать девятая' : 39, 'сороковая' : 40, 'сорок первая' : 41, 'сорок вторая' : 42, 'сорок третья' : 43, 'сорок четвёртая' : 44, 'сорок пятая' : 45, 'сорок шестая' : 46, 'сорок седьмая' : 47, 'сорок восьмая' : 48, 'сорок девятая' : 49, 'пятидесятая' : 50, 'пятьдесят первая' : 51, 'пятьдесят вторая' : 52, 'пятьдесят третья' : 53, 'пятьдесят четвёртая' : 54, 'пятьдесят пятая' : 55, 'пятьдесят шестая' : 56, 'пятьдесят седьмая' : 57, 'пятьдесят восьмая' : 58, 'пятьдесят девятая' : 59, 'шестидесятая' : 60, 'шестьдесят первая' : 61, 'шестьдесят вторая' : 62, 'шестьдесят третья' : 63, 'шестьдесят четвёртая' : 64, 'шестьдесят пятая' : 65, 'шестьдесят шестая' : 66, 'шестьдесят седьмая' : 67, 'шестьдесят восьмая' : 68, 'шестьдесят девятая' : 69, 'семидесятая' : 70, 'семьдесят первая' : 71, 'семьдесят вторая' : 72, 'семьдесят третья' : 73, 'семьдесят четвёртая' : 74, 'семьдесят пятая' : 75, 'семьдесят шестая' : 76, 'семьдесят седьмая' : 77, 'семьдесят восьмая' : 78, 'семьдесят девятая' : 79, 'восьмидесятая' : 80, 'восемьдесят первая' : 81, 'восемьдесят вторая' : 82, 'восемьдесят третья' : 83, 'восемьдесят четвёртая' : 84, 'восемьдесят пятая' : 85, 'восемьдесят шестая' : 86, 'восемьдесят седьмая' : 87, 'восемьдесят восьмая' : 88, 'восемьдесят девятая' : 89, 'девяностая' : 90, 'девяносто первая' : 91, 'девяносто вторая' : 92, 'девяносто третья' : 93, 'девяносто четвёртая' : 94, 'девяносто пятая' : 95, 'девяносто шестая' : 96, 'девяносто седьмая' : 97, 'девяносто восьмая' : 98, 'девяносто девятая' : 99, 'сотая' : 100}
    dic_7 = {'вторых' : 2, 'третьих' : 3, 'четвёртых' : 4, 'пятых' : 5, 'шестых' : 6, 'седьмых' : 7, 'восьмых' : 8, 'девятых' : 9, 'десятых' : 10, 'одиннадцатых' : 11, 'двенадцатых' : 12, 'тринадцатых' : 13, 'четырнадцатых' : 14, 'пятнадцатых' : 15, 'шестнадцатых' : 16, 'семнадцатых' : 17, 'восемнадцатых' : 18, 'девятнадцатых' : 19, 'двадцатых' : 20, 'двадцать первых' : 21, 'двадцать вторых' : 22, 'двадцать третьих' : 23, 'двадцать четвёртых' : 24, 'двадцать пятых' : 25, 'двадцать шестых' : 26, 'двадцать седьмых' : 27, 'двадцать восьмых' : 28, 'двадцать девятых' : 29, 'тридцатых' : 30, 'тридцать первых' : 31, 'тридцать вторых' : 32, 'тридцать третьих' : 33, 'тридцать четвёртых' : 34, 'тридцать пятых' : 35, 'тридцать шестых' : 36, 'тридцать седьмых' :37, 'тридцать восьмых' : 38, 'тридцать девятых' : 39, 'сороковых' : 40, 'сорок первых' : 41, 'сорок вторых' : 42, 'сорок третьих' : 43, 'сорок четвёртых' : 44, 'сорок пятых' : 45, 'сорок шестых' : 46, 'сорок седьмых' : 47, 'сорок восьмых' : 48, 'сорок девятых' : 49, 'пятидесятых' : 50, 'пятьдесят первых' : 51, 'пятьдесят вторых' : 52, 'пятьдесят третьих' : 53, 'пятьдесят четвёртых' : 54, 'пятьдесят пятых' : 55, 'пятьдесят шестых' : 56, 'пятьдесят седьмых' : 57, 'пятьдесят восьмых' : 58, 'пятьдесят девятых' : 59, 'шестидесятых' : 60, 'шестьдесят первых' : 61, 'шестьдесят вторых' : 62, 'шестьдесят третьих' : 63, 'шестьдесят четвёртых' : 64, 'шестьдесят пятых' : 65, 'шестьдесят шестых' : 66, 'шестьдесят седьмых' : 67, 'шестьдесят восьмых' : 68, 'шестьдесят девятых' : 69, 'семидесятых' : 70, 'семьдесят первых' : 71, 'семьдесят вторых' : 72, 'семьдесят третьих' : 73, 'семьдесят четвёртых' : 74, 'семьдесят пятых' : 75, 'семьдесят шестых' : 76, 'семьдесят седьмых' : 77, 'семьдесят восьмых' : 78, 'семьдесят девятых' : 79, 'восьмидесятых' : 80, 'восемьдесят первых' : 81, 'восемьдесят вторых' : 82, 'восемьдесят третьих' : 83, 'восемьдесят четвёртых' : 84, 'восемьдесят пятых' : 85, 'восемьдесят шестых' : 86, 'восемьдесят седьмых' : 87, 'восемьдесят восьмых' : 88, 'восемьдесят девятых' : 89, 'девяностых' : 90, 'девяносто первых' : 91, 'девяносто вторых' : 92, 'девяносто третьих' : 93, 'девяносто четвёртых' : 94, 'девяносто пятых' : 95, 'девяносто шестых' : 96, 'девяносто седьмых' : 97, 'девяносто восьмых' : 98, 'девяносто девятых' : 99, 'сотых' : 100}
    for i in dic_5:
        if i in a:
            count += 1
    #print(count)
    if 'плюс' in a and count == 0:
        b = a[0 : a.find('плюс') - 1 : 1]
        c = a[a.find('плюс') + 5 : len(a) : 1]
        #print(c)
        #print(d)
        if b not in dic_1:
            pris += 1
        if c not in dic_1:
            pris += 1
        if pris == 0:
            for i in dic_1:
                if b == i:
                    b_1 = dic_1.get(i)
            for i in dic_1:
                if c == i:
                    c_1 = dic_1.get(i)
            #print(b_1)
            #print(c_1)
            summ = b_1 + c_1
            if summ < 100:
                for i in dic_1:
                    if dic_1[i] == summ:
                        print(i)
            elif summ >= 100:
                summ_1 = summ % 100
                for i in dic_1:
                    if dic_1[i] == summ_1:
                        print('сто', i)
        elif pris != 0:
            print('Некорректная запись числа!')
    elif 'плюс' in a and count != 0:
        b = a[0 : a.find('плюс') - 1 : 1]
        c = a[a.find('плюс') + 5 : len(a) : 1]
        #print('b =', b)
        #print('c =', c)
        if ' и ' not in b:
            if b.count(' ') == 0:
                d = a[0 : a.find('плюс') - 1 : 1]
                e = 'первых'
                for i in dic_1:
                    if d == i:
                        d_1 = dic_1.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 1:
                d = b[0 : b.find(' ') : 1]
                e = b[b.find(' ') + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 2:
                d = b[0 : b.rfind(' ') : 1]
                e = b[b.rfind(' ') + 1 : len(b) : 1]
                if d not in dic_1:
                    d = b[0 : b.find(' ') : 1]
                    e = b[b.find(' ') + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 3:
                d = b[0 : b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) : 1]  #e = b[0 : b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) : 1]
                e = b[b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
        elif ' и ' in b:
            f = b[0 : b.find(' и ') : 1]  #f = b[0 : a.find(' и ') : 1]
            g = b[b.find(' и ') + 3: len(b) : 1]  #g = b[a.find(' и ') + 3: len(b) : 1]
            for i in dic_1:
                if f == i:
                    f_1 = dic_1.get(i)
            if g.count(' ') == 1:
                d = g[0 : g.find(' ') : 1]
                e = g[g.find(' ') + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif g.count(' ') == 2:
                d = g[0 : g.rfind(' ') : 1]
                e = g[g.rfind(' ') + 1 : len(g) : 1]
                if d not in dic_1:
                    d = g[0 : g.find(' ') : 1]
                    e = g[g.find(' ') + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif g.count(' ') == 3:
                d = g[0 : g.find(' ', g.find(' ') + 1, g.rfind(' ') - 1) : 1]
                e = g[g.find(' ', g.find(' ') + 1, g.rfind(' ') - 1) + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
        if d not in dic_1 and d not in dic_4:
            pris += 1
        if e not in dic_5:
            pris += 1
        if ' и ' not in c:
            if c.count(' ') == 0:
                h = a[a.find('плюс') + 5 : len(a) : 1]
                l = 'первых'
                for i in dic_1:
                    if h == i:
                        h_1 = dic_1.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif c.count(' ') == 1:
                h = c[0 : c.find(' ') : 1]
                l = c[c.find(' ') + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif c.count(' ') == 2:
                h = c[0 : c.rfind(' ') : 1]
                l = c[c.rfind(' ') + 1 : len(c) : 1] #l = c[b.rfind(' ') + 1 : len(c) : 1]
                if h not in dic_1:
                    h = c[0 : c.find(' ') : 1]
                    l = c[c.find(' ') + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
                #print('c.count(' ') == 2')
            elif c.count(' ') == 3:
                h = c[0 : c.find(' ', c.find(' ') + 1, c.rfind(' ') - 1) : 1]
                l = c[c.find(' ', c.find(' ') + 1, c.rfind(' ') - 1) + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            #print('h =', h, 'l =', l)
        elif ' и ' in c:
            m = c[0 : c.find(' и ') : 1]  #m = c[0 : a.find(' и ') : 1]
            n = c[c.find(' и ') + 3: len(c) : 1]  #n = c[a.find(' и ') + 3: len(c) : 1]
            for i in dic_1:
                if m == i:
                    m_1 = dic_1.get(i)
            if n.count(' ') == 1:
                h = n[0 : n.find(' ') : 1]
                l = n[n.find(' ') + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif n.count(' ') == 2:
                h = n[0 : n.rfind(' ') : 1]
                l = n[n.rfind(' ') + 1 : len(n) : 1]
                if h not in dic_1:
                    h = n[0 : n.find(' ') : 1]
                    l = n[n.find(' ') + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif n.count(' ') == 3:
                h = n[0 : n.find(' ', n.find(' ') + 1, n.rfind(' ') - 1) : 1]
                l = n[n.find(' ', n.find(' ') + 1, n.rfind(' ') - 1) + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
        if h not in dic_1 and h not in dic_4:
            pris += 1
        if l not in dic_5:
            pris += 1
        if d_1 >= e_1 and b.count(' ') != 0:
            pris += 1
        if h_1 >= l_1 and c.count(' ') != 0:
            pris += 1
        if pris == 0:
            #print('f_1 =', f_1, 'd_1 =', d_1, 'e_1 =', e_1)
            #print('m_1 =', m_1, 'h_1 =', h_1, 'l_1 =', l_1)
            o = f_1 * e_1 * l_1 + d_1 * l_1 + e_1 * m_1 * l_1 + e_1 * h_1
            p = e_1 * l_1
            #print(o, '/', p)
            (o_1, p_1) = (o, p)
            while o_1 > 1:
                if o_1 % q == 0:
                    lst_1.append(q)
                    o_1 = o_1 // q
                else:
                    q += 1
            while p_1 > 1:
                if p_1 % r == 0:
                    lst_2.append(r)
                    p_1 = p_1 // r
                else:
                    r += 1
            if lst_1 == []:
                lst_1 = [0]
            #print(lst_1)
            #print(lst_2)
            for i in range(len(lst_1)):
                for j in range(len(lst_2)):
                    if lst_1[i] == lst_2[j]:
                        lst_1[i] = 1
                        lst_2[j] = 1
                        break
            #for i in lst_1:
                #for j in lst_2:
                    #if i == j:
                        #lst_1 = [1]
                        #lst_2.remove(j)
                        #break
            #if len(lst_1) == 1:
                #for i in lst_1:
                    #for j in lst_2:
                        #if i == j:
                            #lst_1 = [1]
                            #lst_2.remove(j)
                            #break
            #print(lst_1)
            #print(lst_2)
            for i in range(0, len(lst_1)):
                o_2 *= lst_1[i]
            for i in range(0, len(lst_2)):
                p_2 *= lst_2[i]
            #print(o_2, '/', p_2)
            #print('o_2 =', o_2, 'p_2 =', p_2)
            #if o_2 == p_2:
                #o_3 = 'один'
                #print(o_3)
            if o_2 % p_2 == 0:
                for i in dic_1:
                    if dic_1[i] == o_2 // p_2:
                        o_3 = i
                print(o_3)
            elif o_2 == 1:
                if p_2 < 100:
                    for i in dic_6:
                        if dic_6[i] == p_2:
                            p_3 = i
                elif p_2 >= 100 and p_2 < 1000:
                    if p_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == p_2 // 100:
                                p_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_6:
                                if dic_2[i] == p_2 // 100 and dic_6[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                elif p_2 >= 1000 and p_2 < 10000:
                    if p_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == p_2 // 1000:
                                p_3 = i
                    elif p_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10:
                                    p_3 = i + ' ' + j
                    elif (p_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_6:
                                if dic_3[i] == p_2 // 1000 and dic_6[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_6:
                                    if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10 and dic_6[k] == p_2 % 100:
                                        p_3 = i + ' ' + j + ' ' + k
                print('одна', p_3)
            else:
                if o_2 < 100:
                    for i in dic_4:  # for i in dic_1:
                        if dic_4[i] == o_2:  #if dic_1[i] == o_2:
                            o_3 = i
                elif o_2 >= 100 and o_2 < 1000:
                    if o_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == o_2 // 100:
                                o_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_1:
                                if dic_2[i] == o_2 // 100 and dic_1[j] == o_2 % 100:
                                    o_3 = i + ' ' + j
                elif o_2 >= 1000 and o_2 < 10000:
                    if o_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == o_2 // 1000:
                                o_3 = i
                    elif o_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == o_2 // 1000 and dic_2[j] == (o_2 // 100) % 10:
                                    o_3 = i + ' ' + j
                    elif (o_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_1:
                                if dic_3[i] == o_2 // 1000 and dic_1[j] == o_2 % 100:
                                    o_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_1:
                                    if dic_3[i] == o_2 // 1000 and dic_2[j] == (o_2 // 100) % 10 and dic_1[k] == o_2 % 100:
                                        o_3 = i + ' ' + j + ' ' + k
                if p_2 < 100:
                    for i in dic_7:
                        if dic_7[i] == p_2:
                            p_3 = i
                elif p_2 >= 100 and p_2 < 1000:
                    if p_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == p_2 // 100:
                                p_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_7:
                                if dic_2[i] == p_2 // 100 and dic_7[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                elif p_2 >= 1000 and p_2 < 10000:
                    if p_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == p_2 // 1000:
                                p_3 = i
                    elif p_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10:
                                    p_3 = i + ' ' + j
                    elif (p_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_7:
                                if dic_3[i] == p_2 // 1000 and dic_7[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_7:
                                    if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10 and dic_7[k] == p_2 % 100:
                                        p_3 = i + ' ' + j + ' ' + k
                print(o_3, p_3)
        elif pris != 0:
            print('некорректная запись числа!')
    elif 'минус' in a and count == 0:
        b = a[0 : a.find('минус') - 1 : 1]
        c = a[a.find('минус') + 6 : len(a) : 1]
        #print(b)
        #print(c)
        if b not in dic_1:
            pris += 1
        if c not in dic_1:
            pris += 1
        if pris == 0:
            for i in dic_1:
                if b == i:
                    b_1 = dic_1.get(i)
            for i in dic_1:
                if c == i:
                    c_1 = dic_1.get(i)
            #print(c_1)
            #print(d_1)
            ras = b_1 - c_1
            if ras >= 0:
                for i in dic_1:
                    if dic_1[i] == ras:
                        print(i)
            else:
                ras = abs(ras)
                for i in dic_1:
                    if dic_1[i] == ras:
                        print('минус', i)
        elif pris != 0:
            print('некорректная запись числа!')          
    elif 'минус' in a and count != 0:
        b = a[0 : a.find('минус') - 1 : 1]
        c = a[a.find('минус') + 6 : len(a) : 1]
        if ' и ' not in b:
            if b.count(' ') == 0:
                d = a[0 : a.find('минус') - 1 : 1]
                e = 'первых'
                for i in dic_1:
                    if d == i:
                        d_1 = dic_1.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 1:
                d = b[0 : b.find(' ') : 1]
                e = b[b.find(' ') + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 2:
                d = b[0 : b.rfind(' ') : 1]
                e = b[b.rfind(' ') + 1 : len(b) : 1]
                if d not in dic_1:
                    d = b[0 : b.find(' ') : 1]
                    e = b[b.find(' ') + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 3:
                d = b[0 : b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) : 1]  #e = b[0 : b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) : 1]
                e = b[b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
        elif ' и ' in b:
            f = b[0 : b.find(' и ') : 1]  #f = b[0 : a.find(' и ') : 1]
            g = b[b.find(' и ') + 3: len(b) : 1]  #g = b[a.find(' и ') + 3: len(b) : 1]
            for i in dic_1:
                if f == i:
                    f_1 = dic_1.get(i)
            if g.count(' ') == 1:
                d = g[0 : g.find(' ') : 1]
                e = g[g.find(' ') + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif g.count(' ') == 2:
                d = g[0 : g.rfind(' ') : 1]
                e = g[g.rfind(' ') + 1 : len(g) : 1]
                if d not in dic_1:
                    d = g[0 : g.find(' ') : 1]
                    e = g[g.find(' ') + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif g.count(' ') == 3:
                d = g[0 : g.find(' ', g.find(' ') + 1, g.rfind(' ') - 1) : 1]
                e = g[g.find(' ', g.find(' ') + 1, g.rfind(' ') - 1) + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
        if d not in dic_1 and d not in dic_4:
            pris += 1
        if e not in dic_5:
            pris += 1
        if ' и ' not in c:
            if c.count(' ') == 0:
                h = a[a.find('минус') + 6 : len(a) : 1]
                l = 'первых'
                for i in dic_1:
                    if h == i:
                        h_1 = dic_1.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif c.count(' ') == 1:
                h = c[0 : c.find(' ') : 1]
                l = c[c.find(' ') + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif c.count(' ') == 2:  #if b.count(' ') == 2:
                h = c[0 : c.rfind(' ') : 1]
                l = c[c.rfind(' ') + 1 : len(c) : 1] #l = c[b.rfind(' ') + 1 : len(c) : 1]
                if h not in dic_1:
                    h = c[0 : c.find(' ') : 1]
                    l = c[c.find(' ') + 1 : len(c) : 1] #l = c[b.find(' ') + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif c.count(' ') == 3:  #if b.count(' ') == 3:
                h = c[0 : c.find(' ', c.find(' ') + 1, c.rfind(' ') - 1) : 1]
                l = c[c.find(' ', c.find(' ') + 1, c.rfind(' ') - 1) + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
        elif ' и ' in c:
            m = c[0 : c.find(' и ') : 1]  #m = c[0 : a.find(' и ') : 1]
            n = c[c.find(' и ') + 3: len(c) : 1]  #n = c[a.find(' и ') + 3: len(c) : 1]
            for i in dic_1:
                if m == i:
                    m_1 = dic_1.get(i)
            if n.count(' ') == 1:
                h = n[0 : n.find(' ') : 1]
                l = n[n.find(' ') + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif n.count(' ') == 2:
                h = n[0 : n.rfind(' ') : 1]
                l = n[n.rfind(' ') + 1 : len(n) : 1]
                if h not in dic_1:
                    h = n[0 : n.find(' ') : 1]
                    l = n[n.find(' ') + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif n.count(' ') == 3:
                h = n[0 : n.find(' ', n.find(' ') + 1, n.rfind(' ') - 1) : 1]
                l = n[n.find(' ', n.find(' ') + 1, n.rfind(' ') - 1) + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
        if h not in dic_1 and h not in dic_4:
            pris += 1
        if l not in dic_5:
            pris += 1
        if d_1 >= e_1 and b.count(' ') != 0:
            pris += 1
        if h_1 >= l_1 and c.count(' ') != 0:
            pris += 1
        if pris == 0:
            #print('f_1 =', f_1, 'd_1 =', d_1, 'e_1 =', e_1)
            #print('m_1 =', m_1, 'h_1 =', h_1, 'l_1 =', l_1)        
            o = f_1 * e_1 * l_1 + d_1 * l_1 - e_1 * m_1 * l_1 - e_1 * h_1
            p = e_1 * l_1
            if o < 0:
                o = abs(o)
                prisnak = 1
            #print(o, '/', p)
            (o_1, p_1) = (o, p)
            while o_1 > 1:
                if o_1 % q == 0:
                    lst_1.append(q)
                    o_1 = o_1 // q
                else:
                    q += 1
            while p_1 > 1:
                if p_1 % r == 0:
                    lst_2.append(r)
                    p_1 = p_1 // r
                else:
                    r += 1
            #print(lst_1)
            #print(lst_2)
            #for i in lst_1:
                #if i in lst_2:
                    #lst_1.remove(i)
                    #lst_2.remove(i)
            #if len(lst_1) == 1:
                #for i in lst_1:
                    #for j in lst_2:
                        #if i == j:
                            #lst_1 = [1]
                            #lst_2.remove(j)
                            #break
            for i in range(len(lst_1)):
                for j in range(len(lst_2)):
                    if lst_1[i] == lst_2[j]:
                        lst_1[i] = 1
                        lst_2[j] = 1
                        break
            #print(lst_1)
            #print(lst_2)
            for i in range(0, len(lst_1)):
                o_2 *= lst_1[i]
            for i in range(0, len(lst_2)):
                p_2 *= lst_2[i]
            #print(o_2, '/', p_2)
            if o == 0:
                o_3 = 'ноль'
                print(o_3)
            #elif o_2 == p_2 and prisnak == 0:
                #o_3 = 'один'
                #print(o_3)
            #elif o_2 == p_2 and prisnak == 1:
                #o_3 = 'минус один'
                #print(o_3)
            elif o_2 % p_2 == 0:
                for i in dic_1:
                    if dic_1[i] == o_2 // p_2:
                        o_3 = i
                if prisnak == 0:
                    print(o_3)
                elif prisnak == 1:
                    print('минус', o_3)
            elif o_2 == 1:
                if p_2 < 100:
                    for i in dic_6:
                        if dic_6[i] == p_2:
                            p_3 = i
                elif p_2 >= 100 and p_2 < 1000:
                    if p_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == p_2 // 100:
                                p_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_6:
                                if dic_2[i] == p_2 // 100 and dic_6[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                elif p_2 >= 1000 and p_2 < 10000:
                    if p_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == p_2 // 1000:
                                p_3 = i
                    elif p_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10:
                                    p_3 = i + ' ' + j
                    elif (p_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_6:
                                if dic_3[i] == p_2 // 1000 and dic_6[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_6:
                                    if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10 and dic_6[k] == p_2 % 100:
                                        p_3 = i + ' ' + j + ' ' + k
                if prisnak == 0:
                    print('одна', p_3)
                elif prisnak == 1:
                    print('минус одна', p_3)
            else:
                if o_2 < 100:
                    for i in dic_4:  #for i in dic_1:
                        if dic_4[i] == o_2:  #if dic_1[i] == o_2:
                            o_3 = i
                elif o_2 >= 100 and o_2 < 1000:
                    if o_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == o_2 // 100:
                                o_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_1:
                                if dic_2[i] == o_2 // 100 and dic_1[j] == o_2 % 100:
                                    o_3 = i + ' ' + j
                elif o_2 >= 1000 and o_2 < 10000:
                    if o_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == o_2 // 1000:
                                o_3 = i
                    elif o_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == o_2 // 1000 and dic_2[j] == (o_2 // 100) % 10:
                                    o_3 = i + ' ' + j
                    elif (o_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_1:
                                if dic_3[i] == o_2 // 1000 and dic_1[j] == o_2 % 100:
                                    o_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_1:
                                    if dic_3[i] == o_2 // 1000 and dic_2[j] == (o_2 // 100) % 10 and dic_1[k] == o_2 % 100:
                                        o_3 = i + ' ' + j + ' ' + k
                if p_2 < 100:
                    for i in dic_7:
                        if dic_7[i] == p_2:
                            p_3 = i
                elif p_2 >= 100 and p_2 < 1000:
                    if p_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == p_2 // 100:
                                p_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_7:
                                if dic_2[i] == p_2 // 100 and dic_7[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                elif p_2 >= 1000 and p_2 < 10000:
                    if p_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == p_2 // 1000:
                                p_3 = i
                    elif p_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10:
                                    p_3 = i + ' ' + j
                    elif (p_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_7:
                                if dic_3[i] == p_2 // 1000 and dic_7[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_7:
                                    if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10 and dic_7[k] == p_2 % 100:
                                        p_3 = i + ' ' + j + ' ' + k
                if prisnak == 0:
                    print(o_3, p_3)
                elif prisnak == 1:
                    print('минус', o_3, p_3)
        elif pris != 0:
            print('некорректная запись числа!') 
    elif 'умножить' in a and count == 0:
        b = a[0 : a.find('умножить') - 1 : 1]
        c = a[a.find('умножить') + 9 : len(a) : 1]
        #print(b)
        #print(c)
        for i in dic_1:
            if b == i:
                b_1 = dic_1.get(i)
        for i in dic_1:
            if c == i:
                c_1 = dic_1.get(i)
        #print(b_1)
        #print(c_1)
        proisv = b_1 * c_1
        if proisv < 100:
            for i in dic_1:
                if dic_1[i] == proisv:
                    print(i)
        elif proisv >= 100 and proisv < 1000:
            #e = proisv // 100
            #f = proisv % 100
            if proisv % 100 == 0:
                for i in dic_2:
                    if dic_2[i] == proisv // 100:
                        print(i)
            else:
                for i in dic_2:
                    for j in dic_1:
                        if dic_2[i] == proisv // 100 and dic_1[j] == proisv % 100:
                            print(i, j)
            #print(e, f)
        elif proisv >= 1000 and proisv < 10000:
            e = proisv // 1000
            f = (proisv // 100) % 10
            g = proisv % 100
            if proisv % 1000 == 0:
                for i in dic_3:
                    if dic_3[i] == proisv // 1000:
                        print(i)
            elif proisv % 100 == 0:
                for i in dic_3:
                    for j in dic_2:
                        if dic_3[i] == proisv // 1000 and dic_2[j] == (proisv // 100) % 10:
                            print(i, j)
            elif (proisv // 100) % 10 == 0:
                for i in dic_3:
                    for j in dic_1:
                        if dic_3[i] == proisv // 1000 and dic_1[j] == proisv % 100:
                            print(i, j)
            else:
                for i in dic_3:
                    for j in dic_2:
                        for k in dic_1:
                            if dic_3[i] == proisv // 1000 and dic_2[j] == (proisv // 100) % 10 and dic_1[k] == proisv % 100:
                                print(i, j, k)
            #print(e, f, g)    
    elif 'умножить' in a and count != 0:
        b = a[0 : a.find('умножить') - 1 : 1]
        c = a[a.find('умножить') + 9 : len(a) : 1]
        #print('b =', b)
        #print('c =', c)
        if ' и ' not in b:
            if b.count(' ') == 0:
                d = a[0 : a.find('умножить') - 1 : 1]
                e = 'первых'
                for i in dic_1:
                    if d == i:
                        d_1 = dic_1.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 1:
                d = b[0 : b.find(' ') : 1]
                e = b[b.find(' ') + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 2:
                d = b[0 : b.rfind(' ') : 1]
                e = b[b.rfind(' ') + 1 : len(b) : 1]
                if d not in dic_1:
                    d = b[0 : b.find(' ') : 1]
                    e = b[b.find(' ') + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif b.count(' ') == 3:
                d = b[0 : b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) : 1]  #e = b[0 : b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) : 1]
                e = b[b.find(' ', b.find(' ') + 1, b.rfind(' ') - 1) + 1 : len(b) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
        elif ' и ' in b:
            f = b[0 : b.find(' и ') : 1]  #f = b[0 : a.find(' и ') : 1]
            g = b[b.find(' и ') + 3: len(b) : 1]  #g = b[a.find(' и ') + 3: len(b) : 1]
            for i in dic_1:
                if f == i:
                    f_1 = dic_1.get(i)
            if g.count(' ') == 1:
                d = g[0 : g.find(' ') : 1]
                e = g[g.find(' ') + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif g.count(' ') == 2:
                d = g[0 : g.rfind(' ') : 1]
                e = g[g.rfind(' ') + 1 : len(g) : 1]
                if d not in dic_1:
                    d = g[0 : g.find(' ') : 1]
                    e = g[g.find(' ') + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
            elif g.count(' ') == 3:
                d = g[0 : g.find(' ', g.find(' ') + 1, g.rfind(' ') - 1) : 1]
                e = g[g.find(' ', g.find(' ') + 1, g.rfind(' ') - 1) + 1 : len(g) : 1]
                for i in dic_4:
                    if d == i:
                        d_1 = dic_4.get(i)
                for i in dic_5:
                    if e == i:
                        e_1 = dic_5.get(i)
        if d not in dic_1 and d not in dic_4:
            pris += 1
        if e not in dic_5:
            pris += 1
        if ' и ' not in c:
            if c.count(' ') == 0:
                h = a[a.find('умножить') + 9 : len(a) : 1]
                l = 'первых'
                for i in dic_1:
                    if h == i:
                        h_1 = dic_1.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif c.count(' ') == 1:
                h = c[0 : c.find(' ') : 1]
                l = c[c.find(' ') + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif c.count(' ') == 2:
                h = c[0 : c.rfind(' ') : 1]
                l = c[c.rfind(' ') + 1 : len(c) : 1] #l = c[b.rfind(' ') + 1 : len(c) : 1]
                if h not in dic_1:
                    h = c[0 : c.find(' ') : 1]
                    l = c[c.find(' ') + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
                #print('c.count(' ') == 2')
            elif c.count(' ') == 3:
                h = c[0 : c.find(' ', c.find(' ') + 1, c.rfind(' ') - 1) : 1]
                l = c[c.find(' ', c.find(' ') + 1, c.rfind(' ') - 1) + 1 : len(c) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            #print('h =', h, 'l =', l)
        elif ' и ' in c:
            m = c[0 : c.find(' и ') : 1]  #m = c[0 : a.find(' и ') : 1]
            n = c[c.find(' и ') + 3: len(c) : 1]  #n = c[a.find(' и ') + 3: len(c) : 1]
            #print('m =', m)
            #print('n =', n)
            for i in dic_1:
                if m == i:
                    m_1 = dic_1.get(i)
            if n.count(' ') == 1:
                h = n[0 : n.find(' ') : 1]
                l = n[n.find(' ') + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif n.count(' ') == 2:
                h = n[0 : n.rfind(' ') : 1]
                l = n[n.rfind(' ') + 1 : len(n) : 1]
                if h not in dic_1:
                    h = n[0 : n.find(' ') : 1]
                    l = n[n.find(' ') + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
            elif n.count(' ') == 3:
                h = n[0 : n.find(' ', n.find(' ') + 1, n.rfind(' ') - 1) : 1]
                l = n[n.find(' ', n.find(' ') + 1, n.rfind(' ') - 1) + 1 : len(n) : 1]
                for i in dic_4:
                    if h == i:
                        h_1 = dic_4.get(i)
                for i in dic_5:
                    if l == i:
                        l_1 = dic_5.get(i)
        if h not in dic_1 and h not in dic_4:
            pris += 1
        if l not in dic_5:
            pris += 1
        if d_1 >= e_1 and b.count(' ') != 0:
            pris += 1
        if h_1 >= l_1 and c.count(' ') != 0:
            pris += 1
        if pris == 0:
            #print('f_1 =', f_1, 'd_1 =', d_1, 'e_1 =', e_1)
            #print('m_1 =', m_1, 'h_1 =', h_1, 'l_1 =', l_1)
            #if d_1 >= e_1 or h_1 >= l_1:
                #print('Числитель больше знаменателя')
            o = f_1 * e_1 * m_1 * l_1 + f_1 * e_1 * h_1 + d_1 * m_1 * l_1 + d_1 * h_1
            p = e_1 * l_1
            #print(o, '/', p)
            (o_1, p_1) = (o, p)
            while o_1 > 1:
                if o_1 % q == 0:
                    lst_1.append(q)
                    o_1 = o_1 // q
                else:
                    q += 1
            while p_1 > 1:
                if p_1 % r == 0:
                    lst_2.append(r)
                    p_1 = p_1 // r
                else:
                    r += 1
            #print(lst_1)
            #print(lst_2)
            for i in range(len(lst_1)):
                for j in range(len(lst_2)):
                    if lst_1[i] == lst_2[j]:
                        lst_1[i] = 1
                        lst_2[j] = 1
                        break
            #for i in lst_1:
                #for j in lst_2:
                    #if i == j:
                        #lst_1 = [1]
                        #lst_2.remove(j)
                        #break
            #if len(lst_1) == 1:
                #for i in lst_1:
                    #for j in lst_2:
                        #if i == j:
                            #lst_1 = [1]
                            #lst_2.remove(j)
                            #break
            #print(lst_1)
            #print(lst_2)
            for i in range(0, len(lst_1)):
                o_2 *= lst_1[i]
            for i in range(0, len(lst_2)):
                p_2 *= lst_2[i]
            #print(o_2, '/', p_2)
            #print('o_2 =', o_2, 'p_2 =', p_2)
            #if o_2 == p_2:
                #o_3 = 'один'
                #print(o_3)
            if o == 0:
                print('ноль')
            elif o_2 % p_2 == 0:
                for i in dic_1:
                    if dic_1[i] == o_2 // p_2:
                        o_3 = i
                print(o_3)
            elif o_2 == 1:
                if p_2 < 100:
                    for i in dic_6:
                        if dic_6[i] == p_2:
                            p_3 = i
                elif p_2 >= 100 and p_2 < 1000:
                    if p_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == p_2 // 100:
                                p_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_6:
                                if dic_2[i] == p_2 // 100 and dic_6[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                elif p_2 >= 1000 and p_2 < 10000:
                    if p_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == p_2 // 1000:
                                p_3 = i
                    elif p_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10:
                                    p_3 = i + ' ' + j
                    elif (p_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_6:
                                if dic_3[i] == p_2 // 1000 and dic_6[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_6:
                                    if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10 and dic_6[k] == p_2 % 100:
                                        p_3 = i + ' ' + j + ' ' + k
                print('одна', p_3)
            else:
                if o_2 < 100:
                    for i in dic_4:  #for i in dic_1:
                        if dic_4[i] == o_2:  #if dic_1[i] == o_2:
                            o_3 = i
                elif o_2 >= 100 and o_2 < 1000:
                    if o_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == o_2 // 100:
                                o_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_1:
                                if dic_2[i] == o_2 // 100 and dic_1[j] == o_2 % 100:
                                    o_3 = i + ' ' + j
                elif o_2 >= 1000 and o_2 < 10000:
                    if o_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == o_2 // 1000:
                                o_3 = i
                    elif o_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == o_2 // 1000 and dic_2[j] == (o_2 // 100) % 10:
                                    o_3 = i + ' ' + j
                    elif (o_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_1:
                                if dic_3[i] == o_2 // 1000 and dic_1[j] == o_2 % 100:
                                    o_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_1:
                                    if dic_3[i] == o_2 // 1000 and dic_2[j] == (o_2 // 100) % 10 and dic_1[k] == o_2 % 100:
                                        o_3 = i + ' ' + j + ' ' + k
                if p_2 < 100:
                    for i in dic_7:
                        if dic_7[i] == p_2:
                            p_3 = i
                elif p_2 >= 100 and p_2 < 1000:
                    if p_2 % 100 == 0:
                        for i in dic_2:
                            if dic_2[i] == p_2 // 100:
                                p_3 = i
                    else:
                        for i in dic_2:
                            for j in dic_7:
                                if dic_2[i] == p_2 // 100 and dic_7[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                elif p_2 >= 1000 and p_2 < 10000:
                    if p_2 % 1000 == 0:
                        for i in dic_3:
                            if dic_3[i] == p_2 // 1000:
                                p_3 = i
                    elif p_2 % 100 == 0:
                        for i in dic_3:
                            for j in dic_2:
                                if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10:
                                    p_3 = i + ' ' + j
                    elif (p_2 // 100) % 10 == 0:
                        for i in dic_3:
                            for j in dic_7:
                                if dic_3[i] == p_2 // 1000 and dic_7[j] == p_2 % 100:
                                    p_3 = i + ' ' + j
                    else:
                        for i in dic_3:
                            for j in dic_2:
                                for k in dic_7:
                                    if dic_3[i] == p_2 // 1000 and dic_2[j] == (p_2 // 100) % 10 and dic_7[k] == p_2 % 100:
                                        p_3 = i + ' ' + j + ' ' + k
                print(o_3, p_3)
        elif pris != 0:
            print('некорректная запись числа!')
calc(a)
